"""
На вход программе подается строка текста и строка-разделитель. Напишите программу, которая вставляет указанный
разделитель между каждым символом введенной строки текста.
"""
s = input()
r = input()
print(r.join(s))
